_num = 1
_conf = {
			{0,"open","192.168.100.12",6001},
			{0,"first",6,1},
			{0,"build",1002001},  --建伐木场
			{0,"build",1001001},  --建农田
			{0,"build",18001},  --建训练营
			{0,"upgrade",1},   --升城堡
			{0,"train",17,1001,10},  --造步兵
			{0,"draft",17},  		--收兵
			{0,"fight",{{1001,1}},1},  --收野农田
			{0,"union",2},  		--申请联盟
			{0,"add_union",2},  	--加入联盟
			{0,"union_mass",{{1001,1},},3},  	--集结

			{0,"upgrade",21},  --升农田
			{0,"upgrade",20},  --升伐木场
			{0,"upgrade",22},  --升训练营
			{0,"upgrade",1},   --升城堡
			{0,"upgrade",21},  --升农田
			{0,"upgrade",20},  --升伐木场
			{0,"upgrade",22},  --升训练营

			{0,"fight",{{1001,1}},1},  --收野农田
			{0,"upgrade",1},   --升城堡
			{0,"upgrade",21},  --升农田
			{0,"upgrade",20},  --升伐木场
			{0,"upgrade",3},  --升城墙

			{0,"close"},
	}
