_num = 1
_conf = {
			{0,"open","192.168.0.4",7001},
			{0,"first",3},
			{0,"build",1002001},  --建伐木场
			{0,"build",1001001},  --建农田
			{0,"build",18001},  --建训练营

			{0,"upgrade",1},   --升城堡
			{0,"upgrade",21},  --升农田
			{0,"upgrade",20},  --升伐木场
			{0,"upgrade",22},  --升训练营
	--		{0,"upgrade",3},  --升城墙

			{0,"train",17,1001,1},  --造步兵
			{0,"fight",{{1001,1}}},  --打仗

			{0,"upgrade",1},   --升城堡
			{0,"upgrade",21},  --升农田
			{0,"upgrade",20},  --升伐木场
			{0,"upgrade",22},  --升训练营
		--	{0,"upgrade",3},  --升城墙


			{0,"upgrade",1},   --升城堡
			{0,"upgrade",21},  --升农田
			{0,"upgrade",20},  --升伐木场
			{0,"upgrade",3},  --升城墙

			{0,"close"},
	}
